/*==================================
++++++++++연산자(Operator)++++++++++
- 비트 단위 연산자
====================================
◎ Test022.java
==================================*/


public class Test022
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;

		System.out.printf("~a: %d\n", ~a);
		System.out.printf("~b: %d\n", ~b);
	}
}


/*
a = 10	→	00001010 --(비트열 반전)→	11110101	--(결과)→	-11
											|
											|	2의 보수=(1의 보수)+1
											|
										00001011	--(결과)→ 11

b = -10	→	00001010 --(비트열 반전)→	11110101
										+      1
										--------
										11110110
			11110110 --(비트열 반전)→	00001001	--(결과)→ 9
*/


/*
[실행 결과]
~a: -11
~b: 9
계속하려면 아무 키나 누르십시오 . . .
*/