/*====================================================
++++++++++++++실행 흐름의 컨트롤(제어문)++++++++++++++
- 반복문 (for문) 실습
- 다중 for문(반복문의 중첩)을 활용한 구구단 출력 실습
======================================================
◎ Test058.java
====================================================*/

// 실행 예시
/*
===[2단]===
2 * 1 = 2
   |
2 * 9 = 18

===[3단]===
3 * 1 = 3
   |
3 * 9 = 27

   |
   |

===[9단]===
9 * 1 = 9
   |
9 * 9 = 81

계속하려면 아무 키나 누르십시오 . . .
*/

public class Test058
{
	public static void main(String[] args)
	{
		for (int i=2; i<=9; i++)
		{
			System.out.printf("===[%d단]===\n", i);

			for (int j=1; j<=9; j++)
			{
				System.out.printf("%d * %d = %d\n", i, j, i*j);
			}

			System.out.println();
		}
	}
}

/*
[강사님 풀이]
int i, j;

for (i=2; i<=9; i++)		//--단을 처리하는 반복문 (2, 3, 4, 5, 6, 7, 8, 9)
{
	System.out.printf("===[%d단]===\n", i);

	for (j=1; j<=9; j++)	//--곱해지는 수 처리 (1, 2, 3, 4, 5, 6, 7, 8, 9)
	{
		System.out.printf("%d * %d = %2d\n", i, j, (i*j));
	}

	System.out.println();
}
*/


/*
[실행 결과]
===[2단]===
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

  |
  |
  |

===[9단]===
9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81

계속하려면 아무 키나 누르십시오 . . .
*/